Yourcomputermaster/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьАктов</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Yourcomputermaster/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДлительнаяОперация();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = Объект.Период;
	Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());	
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ДлительнаяОперация();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьАкты(Команда)
	
	Период = Объект.Период;
	Если ЗначениеЗаполнено(Период.ДатаНачала) И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ДлительнаяОперация = ПроведениеДокументовАбПлата(Период.ДатаНачала, Период.ДатаОкончания);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Интервал = 1;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершенииКлиент", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ФормированиеТЧАкты(ДатаНачала, ДатаОкончания)
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
		"Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьЗаполнениеТЧФоново", ДатаНачала, ДатаОкончания);
		
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервере
Функция ПроведениеДокументовАбПлата(ДатаНачала, ДатаОкончания)
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
		"Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьЗаполнениеРеализацийФоново", ДатаНачала, ДатаОкончания);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершенииКлиент(Результат, ДополнительныеПараметры)Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		ВыгрузитьТаблицу(Результат.АдресРезультата);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьТаблицу(Адрес)
	Таблица = ПолучитьИзВременногоХранилища(Адрес);
	Объект.ТабличнаяЧастьАктов.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительнаяОперация()
	
	Период = Объект.Период;
	
	Если ЗначениеЗаполнено(Период.ДатаНачала) И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ДлительнаяОперация = ФормированиеТЧАкты(Период.ДатаНачала, Период.ДатаОкончания);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Интервал = 1;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершенииКлиент", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
